Revit 2027 API
AdvancedTransparent.TransparentDistance Property
 The property labeled "Transparent Distance" from the "AdvancedTransparent" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TransparentDistance { get; }
Public Shared ReadOnly Property TransparentDistance As String
	Get
public:
static property String^ TransparentDistance {
	String^ get ();
}
static member TransparentDistance : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
AdvancedTransparent Class
Autodesk.Revit.DB.Visual Namespace